<template>
  <h1>
    🏦 Дэманстрацыйная банкаўская прыкладанне
  </h1>
  <p>
    Дэманстрацыйны праект, створаны з дапамогай Vue 3.
  </p>
  <h2>
    Тэхнічны стек
  </h2>
  <ul>
    <li>
      🟢 Vue 3
    </li>
    <li>
      🚏 Vue Router
    </li>
    <li>
      🚏 Vue I18n
    </li>
    <li>
      🍍 Pinia
    </li>
    <li>
      🖌️ SCSS
    </li>
  </ul>
  <h2>
    🛠️ Магчымасці
  </h2>
  <ul>
    <li>
      🔑 Адаптыўная верстка з прыярытэтам мабільных прылад
    </li>
    <li>
      🔑 Сістэма аўтэнтыфікацыі
    </li>
    <li>
      ✉️ Дэманстрацыйны працэс пацвярджэння праз электронную пошту / SMS
    </li>
    <li>
      ⚠️ Эмуляцыя дэманстрацыйных памылак
    </li>
    <li>
      🎛️ Старонка панэлі кіравання з паўзункамі картак і апошнімі транзакцыямі
    </li>
    <li>
      💳 Спіс картак
    </li>
    <li>
      📊 Графік даходаў і выдаткаў з фільтрамі
    </li>
    <li>
      🗒️ Гісторыя транзакцый з фільтрамі
    </li>
    <li>
      🌙 Пераключэнне светлай і цёмнай тэмы
    </li>
    <li>
      🌐 Інтэрнацыяналізацыя
    </li>
  </ul>
  <h2>
    💻 Выкарыстанне
  </h2>
  <p>
    Гэты праект з адкрытым зыходным кодам; вы можаце выкарыстоўваць яго без дазволу.
  </p>
  <p>
    <a href="https://github.com/ArtemGrachov/banking-vue" target="_blank">Зыходны код — GitHub</a>
  </p>
  <h2>
    🤖 ШІ
  </h2>
  <p>
    Гэты праект выкарыстоўвае змест, згенераваны штучным інтэлектам (даныя банкаўскіх картак, гісторыя транзакцый, пераклады і праверка граматыкі).
  </p>
  <h2>
    📋 Кіраванне праектам
  </h2>
  <ul>
    <li>
      <a href="https://tree.taiga.io/project/artemgrachov-bda-banking-demo-app/kanban" target="_blank">
        Дошка Taiga
      </a>
    </li>
    <li>
      <a href="https://docs.google.com/document/d/1Dao8Ib7IXkeowtPr9HQdEHsJRrf0u9zd3v91oUl6C_Y/edit?usp=sharing" target="_blank">
        Спецыфікацыя (Google Docs)
      </a>
    </li>
  </ul>
</template>