<template>
  <h1>
    🏦 Банківський Демо-Додаток
  </h1>
  <p>
    Демо-проєкт написаний на Vue 3.
  </p>
  <h2>
    Технічний стек
  </h2>
  <ul>
    <li>
      🟢 Vue 3
    </li>
    <li>
      🚏 Vue Router
    </li>
    <li>
      🚏 Vue I18n
    </li>
    <li>
      🍍 Pinia
    </li>
    <li>
      🖌️ SCSS
    </li>
  </ul>
  <h2>
    🛠️ Функціонал
  </h2>
  <ul>
    <li>
      🔑 Mobile-first адаптивна верстка
    </li>
    <li>
      🔑 Система автентифікації
    </li>
    <li>
      ✉️ Демо Email / SMS підтвердження
    </li>
    <li>
      ⚠️ Емуляція демо-помилок
    </li>
    <li>
      🎛️ Сторінка-дашборд із слайдером карток та переліком останніх транзакцій
    </li>
    <li>
      💳 Список карток
    </li>
    <li>
      📊 Графіки прибутків та витрат
    </li>
    <li>
      🗒️ Історія транзакцій із фільтрами
    </li>
    <li>
      🌙 Перемикання світлої та темної теми
    </li>
    <li>
      🌐 Інтернаціоналізація
    </li>
  </ul>
  <h2>
    💻 Використання
  </h2>
  <p>
    Цей проєкт має відкритий висхідний код; ви можете вільно використовувати його без дозволу.
  </p>
  <p>
    <a href="https://github.com/ArtemGrachov/banking-vue" target="_blank">Висхідний код — GitHub</a>
  </p>
  <h2>
    🤖 ШІ
  </h2>
  <p>
    Цей проєкт використовує ШІ-генерований контент (дані банківських карток, історія транзакцій, переклади та перевірка граматики).
  </p>
  <h2>
    📋 Проєкт-менеджмент
  </h2>
  <ul>
    <li>
      <a href="https://tree.taiga.io/project/artemgrachov-bda-banking-demo-app/kanban" target="_blank">
        Дошка в Taiga
      </a>
    </li>
    <li>
      <a href="https://docs.google.com/document/d/1Dao8Ib7IXkeowtPr9HQdEHsJRrf0u9zd3v91oUl6C_Y/edit?usp=sharing" target="_blank">
        Специфікація (Google Docs)
      </a>
    </li>
  </ul>
</template>